[net]
# Testing
#  batch=28
#  subdivisions=1
# Training
batch=64
subdivisions=16
width=104
height=104
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.000001
burn_in=1000
max_batches = 50200
policy=steps
steps=40000,45000
scales=.1,.1




[convolutional]
batch_normalize=1
filters=64
size=5
stride=1
pad=1
activation=tanh

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=tanh


[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=tanh

[convolutional]
batch_normalize=1
filters=12
size=3
stride=1
pad=1
activation=tanh

[convolutional]
batch_normalize=1
filters=3
size=3
stride=1
pad=1
activation=tanh

[shortcut_input]
from=-1
activation=logistic

[espcn]
filters = 3
scale = 1

[cost]
type=sse